[1,0,0,[["cc.JsonAsset",["_name","json"],1]],[[0,0,1,3]],[[0,"r0",[["Overview: upgrade is trick taking game competing in groups for scores, much ","like a simple variant of bridge. Players are divided into declarers and defenders ","to compete for points (5, 10, K for 5, 10, 10). At the end of the game, if the ","defender's score does not reach the required value, the declarer will upgrade and ","continue to play, otherwise the defender will become the new declarer.\n\n","Grouping: in a four-player game, two players sitting facing each other are fixed partners. ","In a five-player game, the declarer's partner is determined by a friendship card. For example, ","if the declarer designates the second appearance of the ace of hearts as the friendship card, ","then the player who plays the second ace of hearts becomes the declarer's partner, and the ","rest of the players become the defenders. Before the advent of friendship card, players ","get score separately. Note that trump card cannot be designated as friendship card.\n\n","Score: At the end of a round, the winner gets the points included in the round.\n\n","Rank: the current declarer's rank. Starting from 3, sequential to K, and finally to A."],["Trump bidding: during dealing, bid on the trump suit with rank cards of the same suit. ","If the number of rank cards with same suit is more than current bided, you can overbid ","to win. The current bidder may increase the number of rank cards of his ","suit, but may not bid on rank cards of other suits.\n\n","Trump cards and non-trump cards: trump cards include joker, rank card, 2 and the suit specified ","by trump bidding, while the rest of suits are non-trump cards. Suppose rank = 3 and trump ","suit = heart: the trump cards from highest to lowest are big joker, little joker, 3 of ","hearts, 3 of other suits, 2 of hearts, 2 of other suits, ace of hearts, king of hearts","...5 of hearts, 4 of hearts; The non-trump cards are A, K, Q... 5ã€4. Non-trump cards of ","different suits cannot be compared. Trump cards is higher than the non-trump cards of same type.\n\n","Burying: after the end of the deal, the declarer needs to choose a certain number of cards ","as pledge cards, this behavior is called burying. Before the game ends, the back of ","the buried cards are facing up. In the case of a five-player game, the declarer designates a ","friendship card at this stage."],["Hand type: singleton, kind and tractor. Multiple repetitions of the same card are called kind, ","such as a pair of hearts 5s or three 6s of diamonds. Tractor consists of adjacent kinds with ","the same number of cards, like AAAKKK or 6655.\n\n","Hand comparison: only hand types with the same number of cards can be compared. When the ","number of cards is the same, the one containing fewer different cards is higher,for example ","888777>KKQQJJ>887766. Note that the rank cards of non-trump suit are not adjacent to each ","other and are of equal power. The same goes for 2 of non-trump suit. Trump cards of the ","same type is higher than non-trump cards.\n\n","Declarer and upgrade: in the first game, the player who decides the trump suit becomes the ","declarer. At the end of a game, if the score of the defenders is not less than 40*decks, one ","of defenders becomes new declarer, and for every extra 20*decks, the defenders upgrade one ","more rank. Correspondingly, if the score of the defenders is less than 40*decks, the declarers ","upgrade one rank, if the score is less than 20*decks, the declarers upgrade two rank, if the ","score is 0 or less, the declarers upgrade three rank."],["Early hand: You can play non-trump cards of the same suit, or trump cards, but can't mix it. ","Early hand contains more than one hand type is called throw cards. For example, AAAKK=AAKK+A. ","If some hand type contained by throw cards is not invincible, the player's score deduct 5*decks ","as punishment and automatically play the cards of the hand type. The declarer starts first, and ","then the winner in each turn becomes the early hand in the next round.\n\n","Late hand: the late hand plays the same number of cards as the early hand. If there are cards ","of the same suit as early hand, the cards of the same suit must be played, and if there are cards ","of the same type, the cards of the same type must be played; when there is no same hand type, ","choose the hand type with the closest number of cards to the early hand. If you don't have  ","cards of the same suit as early hand, you can play any cards at will.\n\n","Priority of hand types: when cards throwed can be divided into more than one combination, it is ","divided according to the probability of hand type, and the one with the lowest probability of ","hand type appearing takes precedence. For example, 888887766 can be divided into 88888+7766, ","or 887766+888. The probability of 88888 appearing is lower than 887766, so it should be divided into 88888+7766."],["Trump: if early hand played non-trump cards and the late hand does not have a card of the same suit, ","then the late hand can cover early hand with trump cards. Trump must be the same type as early hand ","and cover the current strong hand. For example, if early hand played non-trump cards AAKK, and then ","covered by non-trump cards 6666, at this time you need to cover 6666 with trump cards to trump successfully.\n\n","Overtrump: only compare the cards that correspond to the strongest type in early hand, as shown in the ","illustrated example on next page.\n\n","Dig out: if defenders win the last round, the score contained in cards buried belongs to defenders. ","The calculation formula is: the score contained*decks*times (if defenders win with non-trump cards, ","times = 1; win with trump cards, times = the number of cards of the strongest type of the early hand ","played in final round). For example, in a game of four decks, the declarer has 10 points buried. In the ","last round, the early hand is 999+66, and defenders win the round. If defenders win with non-trump, ","add 10*4 to defenders's score, and if defenders win with trump, add 10*4*3(from 999) to defenders's score."],["r0_1.png"]]]],0,0,[],[],[]]
