[1,0,0,[["cc.JsonAsset",["_name","json"],1]],[[0,0,1,3]],[[0,"r3",[["Overview: bluff is shedding card game. The dealer discards first in the first round of the 1st game. ","The player who discards all the cards in his hand first is the winner.\n\n","Types of cards: bluffing only checks the card points, does not distinguish the suit. A through 10 are ","commons. J, Q, and K are wild cards, can be played as any common. Jokers is omnipotent and can be used ","as any card. Point increase sequentially from A to K. When a hand contains more than one wild card, it ","needs to be wild cards of the same rank to be true. For example, JJ7 is equal to 777, but KJ7 is not ","equal to 777.\n\n","Deception: if the player's actual discarded cards are inconsistent with declared, it is called a deception. ","Deception are the essence of the game, and cards from A to K can be used for deception.\n\n","Early hand: take out some cards, place them face down, and announce  points of cards, such as four cards ","with point 5. The cards that was declared is the current hand."],["Follow: after the previous player has discarded, the next player has three options.\n","    1：Flip over. If you think the player is bluffing, you can choose to flip over his cards for verification. ","If it is not a deception, all the cards in this round belong to the player who chose to flip, and the player ","played those cards becomes early hand of next round. If it is a deception, all the cards in this round belong ","to the player played those cards,and the player who chose to flip becomes early hand of next round. After a ","player discards, all the rest of players are eligible to flip, and if no player chooses to flip, the following ","two selections can be chose.\n","    2：Cover. Playing a higher hand than the current hand (more cards or the same number of cards with higher"," point) to become the new current hand.\n","    3：Pass. Neither flip nor cover.\n","End of a round: If a player's cards are skipped by all the rest of players, the round ends, all cards in the ","round are discarded, and the player becomes early hand in next round. If someone  chooses to flip, the round ","ends immediately, the result depends on the flip."],["r3_1.png"]]]],0,0,[],[],[]]
