[1,0,0,[["cc.JsonAsset",["_name","json"],1]],[[0,0,1,3]],[[0,"r0",[["概要：アップグレードは、ブリッジの単純なバリアントのように、スコアのためにグループで競い合うターン制のポーカーゲームです。","プレイヤーは庄家と闲家に分かれ、スコア（5, 10, K のために 5, 10, 10）を競います。ゲームの終わりに、闲家の得点","が必要な値に達しない場合、庄家はアップグレードしてプレイを続けます。それ以外の場合、闲家が新しい庄家になります。\n\n","グルーピング：4人用ゲームでは、向かい合って座っている2人のプレイヤーが固定パートナーです。5人プレイヤーのゲームでは、","庄家のパートナーは友情的なカードによって決定されます。例えば、庄家がハートのエースの2回目の登場を友情的なカードとして","指定した場合、2回目のハートのエースをプレイするプレイヤーは庄家のパートナーになり、残りのプレイヤーは闲家になります。","友情牌が現れる前、プレイヤーは別々にスコアを得る。注意主牌は友情カードとして指定できません。\n\n","得点：ラウンドが終了すると、勝者はそのラウンドに含まれるポイントを獲得します。\n\n","ランク：現在の庄家のランク。3から始まり、Kまで順に、最後にA。"],["主牌の入札：配牌の過程で、ランク牌によって主牌の花色を決定。同じスートのランクカードの枚数が現在の入札より多い場合、","勝つために入札額を超えることができます。現在の入札者は自分のスートのランクカードの数を増やすことができますが、","他のスートのランクカードには入札できません。\n\n","主牌と副牌：主牌カードにはジョーカー、ランクカード、2、および主牌のビディングで指定されたスーツが含まれ、他のスーツは","副牌カードです。ランク=3、主牌スーツ=ハートと仮定すると、主牌カードは最高から最低まで、フルカラー・ジョーカー、","ジョーカー、ハートの3、他のスーツの3、ハートの2、他のスーツの2、ハートのエース、ハートのキング...ハートの5、","ハートの4となります。副牌カードはA、K、Q... 5、4です。異なるスーツの副牌カードは比較できません。主牌カードは同じタイプ","の副牌カードよりも高いです。\n\n","埋底牌：配牌が終わった後、庄家は一定数のカードを担保として選ぶ必要があります。この行為は埋底牌と呼ばれます。ゲームが終わる前に、","底牌は裏向きに置きます。5人のゲームの場合、ディーラーはこの段階で1枚の友情カードを指定します。"],["牌型：単、条、トラクター。同じカードが複数枚あることを「条」と呼びます。例えば、2枚のハートの5や3枚のダイヤの6などです。","トラクターは同じ牌数で隣接した「条」から構成されています，例えばAAAKKKまたは6655。\n\n","牌型の比較：同じ牌数の牌型だけが比較できます。カードの枚数が同じ場合、異なるカードの枚数が少ない方が上です，例えば","888777>KKQQJJ>887766。主牌の花色以外のランクカードは互いに隣接しておらず、同じパワーを持っていることに注意してください。","2も同様です。同じタイプの主牌は副牌よりも高い。\n\n","庄家とアップグレード：第一ラウンドのゲームで、主牌を決定するプレイヤーが庄家になる。ゲームの終了時に、闲家のスコアが40*デッキ","以上である場合、闲家の1人が新しい庄家となり、さらに20*デッキごとに闲家はもう1ランクアップグレードします。それに応じて、闲家の","得点が40*デッキを下回る場合、庄家は1レベル上がり、得点が20*デッキを下回る場合、庄家は2レベル上がり、得点が0以下の場合、庄家は3","レベル上がります。"],["先手：同じ花色の副牌または主牌を出すことができますが、混ぜることはできません。先手に含まれるカードタイプが複数ある場合、","と呼ばれる「甩牌」。例えばAAAKK=AAKK+A。もし「甩牌」に含まれる牌型は無敵ではない時です、プレイヤーの得点は5*デッキの枚数","がペナルティとして減少し、その牌型は自動的にプレイされます。庄家が最初にスタートし、その後各ターンの勝者が次のラウンドで","先手となります。\n\n","後手：後手は先手と同じ枚数のカードをプレイします。先手と同じスートのカードがあれば、同じスートのカードを出さなければならず、","同じ種類のカードがあれば、同じ種類のカードを出さなければなりません；同じ牌型がない場合は、先手に最も近いカード数の牌型を","選択してください。もし先手と同じスートのカードを持っていなければ、好きなようにカードを出すことができます。\n\n","牌型優先度：甩牌が2つ以上の牌型の組み合わせに分けられる場合、牌型の出現確率に従って分類され、出現しにくい牌型が優先されます。","例えば、888887766は88888+7766に分けることもでき、887766+888にも分けられます。88888の出現確率は887766よりずっと低いため、","88888+7766に分けるべきです。"],["銃殺: もし先手がトランプ以外のカードを出し、後手が同じスートのカードを持っていない場合、後手はトランプで先手をカバーすること","ができます。銃殺は先手と同じタイプでなければならず、現在の強い手をカバーしなければならない。例えば、もし先手で副牌のAAKKを打ち出し、","その後に副牌の6666で覆われた場合、この時にあなたは主牌を使って6666を覆わなければ、銃撃成功とはなりません。\n\n","超殺：先手で最も強いタイプに対応するカードのみを比較してください。次のページに示された図の例のように。\n\n","掘り出す：もし闲家が最終ラウンドに勝った場合、埋められたカードに含まれる得点は闲家のものになります。計算式は次の通りです：","含まれる得点*デッキ数*回数（もし闲家が副牌で勝利した場合、回数 = 1; 主牌で勝利した場合、回数 = 最終ラウンドでプレイされた","先手の最強タイプのカードの枚数）。例えば、4つのデッキのゲームでは、庄家が10ポイント隠れています。最後のラウンドでは、","先手が999+66で、闲家がラウンドを勝ち取ります。もし闲家が副牌で勝った場合、闲家のスコアに10*4を加え、主牌で勝った場合は、","闲家のスコアに10*4*3（999から）を加えます。"],["r0_1.png"]]]],0,0,[],[],[]]
