[1,0,0,[["cc.JsonAsset",["_name","json"],1]],[[0,0,1,3]],[[0,"r2",[["Overview: high score is shedding card game competing in group for scores. ","The two players who sit facing each other are partners. The goal of the game is to get a higher ","score than the other group, 5, 10, and K represent 5 score, 10 score, and 10 score. The player who ","gets the 3 of diamonds first in the first game play first. The player who discards all the cards in ","his hand first is the winner.\n\n","Hand type: singleton, pair (two cards of the same rank), straight (three or more cards with adjacent ","points, like 876. Joker does not participate in straights), airplane (straight consisting of pairs, like ","887766), bomb (three or more cards of the same rank).\n\n","Special bomb: ghost bomb and king bomb. Ghost bomb is a bomb consisting of jokers. King bomb is a bomb ","consisting of two or more jokers and a 2, the power of king bomb is equal to the number of jokers*2, ","which is the largest of the same number. For both types, the bomb composed entirely of big jokers is ","higher than the bomb composed entirely of little jokers; if there are both big joker and little joker, ","the first to discard wins.\n\n","Hand Comparison: bomb can cover all other types of cards. For non-bomb types, only cards of the same ","type and the same number of cards can be compared. For bombs, the number of cards is the primary indicator, ","and the singleton is compared when the numbers are the same."],["Singleton: big joker, little joker, 2, A, King to 3, decreasing in turn. There is no suit differentiation.\n\n","Play: early hand can choose any legal hand. The next player can only play the cards stronger than current hand. ","If you can't or don't want to cover current hand, you can let it pass. When a player's cards are skipped by ","all the other players, the round ends and that player becomes early hand in the next round.\n\n","Pung: when the current type is singleton, if you have a pair of cards of the same rank, you can choose to pung. ","Pung has priority and allows you to skip the player in front of you (if the player in front of you does not pung). ","After the pung, you can only use bomb to cover it. \n\n","End of game: when both players in the same group have all cards played, the game ends at the end of the round. ","If the two players are in second and third place respectively, both sides will draw. Otherwise, the group ","containing the first place wins, and its total score is increased by 50* decks, and the total score of the ","other group is subtracted by 50* decks.\n\n","Special tip: when both people in the same group have finished playing cards, they still have to wait for the ","end of the round to end the game, so the side that still has cards in this round should try to score points ","in this round to reduce losses."],["r2_1.png"]]]],0,0,[],[],[]]
