[1,0,0,[["cc.JsonAsset",["_name","json"],1]],[[0,0,1,3]],[[0,"r1",[["Overview: Big Two is shedding card game. Each player has ","thirteen cards. The player with the min card in the first game play first. ","The player who discards all the cards in his hand first is the winner.\n\n","Play: early hand can choose any legal hand (for the 1st game, early hand of the ","first round must contain the min card). The next player can only play the same ","number of cards and the cards must be stronger than current hand. If you can't ","or don't want to cover current hand, you can let it pass. When a player's cards ","are skipped by all the other players, the round ends and that player becomes ","early hand in the next round.\n\n","Singleton: 3...K, A, 2 increase in turn. On the same rank, spades>hearts>clubs>diamonds.\n\n","Hand type: singleton, pair (two cards of the same rank), three of a kind (three cards of ","the same rank), four of a kind (four cards of the same rank), straight (five cards with ","adjacent points), flush (five cards of the same suit), full house (three of a kind with a ","pair), King Kong (four of a kind with singleton), five of a kind (five cards of the same rank. ","Appears with two decks of cards), straight flush (straight of the same suit)."],["Hand comparison: only hand types with the same number of cards can be compared. When ","comparing the same hand type, follow the principle of points first, suit second. ","Singleton, pair, three of a kind, four of a kind, use the largest single card for comparison. ","For the hand of five cards, straight<flush<full house<King Kong<five of a kind<straight flush. ","When comparing the same hand types, straights and straight flushes are compared using their big end card, ","such as 5 for 5432A, 6 for 65432, and A for AKQJ10. Flush and five of a kind use the highest single ","card, full house uses the highest single card of the three, and King Kong uses the highest single card of the four.\n\n","Scoring: At the end of a game, the remaining cards in your hand will be converted into points and ","accumulated to the upper left corner of the avatar. \n","   Assuming that the number of cards left in the hand is n, the conversion rules are\n","   1：n<8，score=n\n","   2：8<=n<10，score=n*2\n","   3：10<=n<13，score=n*3\n","   4：n=13，score=n*4"],["r1_1.png"]]]],0,0,[],[],[]]
